Public Member Functions | List of all members
ACAPI::MEP::Branch::Modifier Class Reference
MEP Element Manager
Modifier of the Branch. More...
#include <MEPBranch.hpp>
 Inheritance diagram for ACAPI::MEP::Branch::Modifier:
 Public Member Functions
Result< void >  | Inject (const BranchDefault &branchDefault)
Injects the Default settings into the Branch.
 Public Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
void  | SetAnchorPoint (const API_Coord3D &anchorPoint)
Sets the anchor point of the ModifiableElement.
void  | SetOrientation (const MEP::Orientation &orientation)
Sets the orientation of the ModifiableElement.
void  | SetObjectId (const API_Guid &libraryPartId)
Sets the referenced library part of the ModifiableElement.
 Additional Inherited Members
 Protected Member Functions inherited from ACAPI::MEP::ModifiableElementBase::Modifier
Modifier (ModifiableElementBase &parent)
Constructs a Modifier with the parent ModifiableElementBase.
 void  | FinalizeModification () override
Finalizes the modifications.
Detailed Description
Modifier of the Branch.
Member Function Documentation
◆ Inject()
 Result< void > ACAPI::MEP::Branch::Modifier::Inject  |  ( |  const BranchDefault & |  branchDefault | )
Injects the Default settings into the Branch.
Parameters
branchDefault | The Default what will be injected.
Returns
Returns an error if the injection fails for some reason, otherwise nothing.